
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ВыгрузитьДанные(СписокДоступныхВнешнихСистем, ПроизвольныйИнтервал);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ДатаНач = НачалоДня(ТекущаяДата() - 86400*10);
	ДатаКон = КонецДня(ТекущаяДата());
	ПочтовыйАдрес = "data@maifgroup.ru";
	
	Если Не ПроизвольныйИнтервал тогда
		ЭлементыФормы.ДатаНач.Доступность = Ложь;
		ЭлементыФормы.ДатаКон.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроизвольныйИнтервалПриИзменении(Элемент)
	
	Если НЕ ПроизвольныйИнтервал тогда
		ЭлементыФормы.ДатаНач.Доступность = Ложь;
		ЭлементыФормы.ДатаКон.Доступность = Ложь;
	Иначе
		ЭлементыФормы.ДатаНач.Доступность = Истина;
		ЭлементыФормы.ДатаКон.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ДатаНачПриИзменении(Элемент)
	ДатаНач = НачалоДня(Элемент.Значение);
КонецПроцедуры

Процедура ДатаКонПриИзменении(Элемент)
	ДатаКон = КонецДня(Элемент.Значение);
КонецПроцедуры

Процедура ВнешняяСистемаВыбрать()
		
	ОбщаяФормаВыбораИзСписка = ПолучитьОбщуюФорму("ФормаВыбораИзСписка", ЭтаФорма);
	ОбщаяФормаВыбораИзСписка.Список = ПолучитьСписокДоступныхВнешнихСистем();
	ОбщаяФормаВыбораИзСписка.Открыть();
	
КонецПроцедуры

Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	
	Если ТипЗнч(ЗначениеВыбора) = Тип("СписокЗначений") тогда
		
		Для Каждого ЭлементСписка Из ЗначениеВыбора цикл
			
			Если ЭлементСписка.Пометка тогда
				СписокДоступныхВнешнихСистем.Добавить(ЭлементСписка.Значение);
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры


Процедура Кнопка_ВыбратьВСНажатие(Элемент)
	
	ВнешняяСистемаВыбрать();	
	
КонецПроцедуры

