
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура КнопкаПолучитьНоменклатуруНажатие(Элемент)
	
	ПолучитьНоменклатуру();
	
КонецПроцедуры

Процедура КнопкаПолучитьПартииНажатие(Элемент)
	
	ПолучитьПартии();
	
КонецПроцедуры

Процедура КнопкаПолучитьДокументыНажатие(Элемент)
	
	ПолучитьДокументы();
	
КонецПроцедуры

Процедура КнопкаПолучитьТранспортировкиНажатие(Элемент)
	
	ПолучитьТранспортировки();
	
КонецПроцедуры

Процедура КнопкаПодтвердитьПоставкиНажатие(Элемент)
	ПодтвердитьПоставки();
КонецПроцедуры

Процедура КнопкаОтправитьОстаткиНажатие(Элемент)
	
	ОтправитьТекущиеОстатки();
	
КонецПроцедуры

Процедура КнопкаОтправитьКорректировкиОстатковНажатие(Элемент)
	
	ОтправитьКорректировкиОстатков();
	
КонецПроцедуры

Процедура КнопкаОбновитьПоставкиНажатие(Элемент)
	
	ОбновитьПоставки();
	
КонецПроцедуры

Процедура КнопкаВыгрузитьМаршрутыНажатие(Элемент)
	ВыгрузитьМаршрутыЭкспедиторов();
КонецПроцедуры

Процедура КнопкаПолучитьПечатныеФормыНажатие(Элемент)
	ПолучитьПечатныеФормы();
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтруктураЗаписи = Новый Структура("Объект, Свойство, Значение", Партнер, "ДатаПоследнегоОбмена", ТекущаяДатаСеанса());
	
	РегистрыСведений.ДополнительныеРеквизиты_3PL.ДобавитьЗапись(СтруктураЗаписи);
	
КонецПроцедуры

