
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура КнопкаПолучитьНоменклатуруНажатие(Элемент)
	
	ПолучитьНоменклатуру();
	
КонецПроцедуры

Процедура КнопкаПолучитьПартииНажатие(Элемент)
	
	ПолучитьПартии();
	
КонецПроцедуры

Процедура КнопкаПолучитьДокументыНажатие(Элемент)
	
	ПолучитьДокументы();
	
КонецПроцедуры

Процедура КнопкаПолучитьТранспортировкиНажатие(Элемент)
	
	ПолучитьТранспортировки();
	
КонецПроцедуры

Процедура КнопкаПодтвердитьПоставкиНажатие(Элемент)
	ПодтвердитьПоставки();
КонецПроцедуры

Процедура КнопкаОтправитьОстаткиНажатие(Элемент)
	
	ОтправитьТекущиеОстатки();
	
КонецПроцедуры

