
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если НЕ ЗначениеЗаполнено(КаталогХранения) тогда
		Сообщить("Не выбран каталог для хранения файла", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчетXLS();
	
КонецПроцедуры

Процедура ПриОткрытии()
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура КаталогХраненияНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Выбрать();
	Если ЗначениеЗаполнено(ДиалогВыбора.Каталог) тогда
		КаталогХранения = ДиалогВыбора.Каталог;
	Иначе
		Сообщить("Не выбран каталог для хранения файла", СтатусСообщения.Важное);
	КонецЕсли;	
	
КонецПроцедуры
