
Процедура УстановитьРежимПометкиОперации(Режим)
	
	Для Каждого СтрокаТабЧасти Из ВидыОпераций цикл
		
		СтрокаТабЧасти.Пометка = Режим;
		
	КонецЦикла;	
	
КонецПроцедуры	

///////////////////////////////////////////////

Процедура ФайлыОбменПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ОписаниеОшибок) тогда
		ОформлениеСтроки.ЦветФона = WebЦвета.СветлоРозовый;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ФайлыОбменВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = ЭлементыФормы.ФайлыОбмен.ТекущаяСтрока;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ОписаниеОшибок) тогда
		ВывестиОтчетПоОшибкам(СтрокаТабличнойЧасти);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура УстановитьПометкуНажатие(Элемент)
	УстановитьРежимПометкиОперации(Истина);
КонецПроцедуры

Процедура СнятьПометкуНажатие(Элемент)
	УстановитьРежимПометкиОперации(Ложь);
КонецПроцедуры

Процедура ДействияФормыПроверитьСоединение(Кнопка)
	УстановитьСоединение();
КонецПроцедуры

Процедура ОсновныеДействияФормыОбмен(Кнопка)
	ОчиститьСообщения();
	ВыполнитьОбмен(Ложь);
КонецПроцедуры
