

///////////////////////////////////////////////
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ВыполнитьОбмен();	
КонецПроцедуры

Процедура СоздатьФайлыНажатие(Элемент)
	
	ОчиститьСообщения();
	ВыбратьКаталогХраненияФайлов();
	СоздатьФайлы();
	
КонецПроцедуры

Процедура ФайлыОбменПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ОписаниеОшибок) тогда
		ОформлениеСтроки.ЦветФона = WebЦвета.СветлоРозовый;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ФайлыОбменВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = ЭлементыФормы.ФайлыОбмен.ТекущаяСтрока;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ОписаниеОшибок) тогда
		ВывестиОтчетПоОшибкам(СтрокаТабличнойЧасти);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыбратьКаталогХраненияФайлов()
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДиалогВыбора.Выбрать() тогда
		КаталогФайлов = ДиалогВыбора.Каталог + "\";
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры
