
Процедура ЗаполнитьТаблицуОпераций()
	
	Макет = ПолучитьМакет("СписокОпераций");
	
	Стр = 2; // начало настройки для доступные операций
	
	Пока ЗначениеЗаполнено(Макет.Область("R"+Стр+"C1").Текст) цикл
		
		ЯчейкаПометки = Макет.Область("R"+Стр+"C1");
		ЯчейкаОперация = Макет.Область("R"+Стр+"C2");
		ЯчейкаКоманда = Макет.Область("R"+Стр+"C3");
		ЯчейкаТипа = Макет.Область("R"+Стр+"C4");
		
		НовСтр = ВидыОпераций.Добавить();
		НовСтр.Пометка = Булево(СокрЛП(ЯчейкаПометки.Текст));
		НовСтр.Наименование = СокрЛП(ЯчейкаОперация.Текст);
		НовСтр.Команда = СокрЛП(ЯчейкаКоманда.Текст);
		НовСтр.ТипОперации = СокрЛП(ЯчейкаТипа.Текст);
		
		Стр = Стр + 1;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура УстановитьРежимПометкиОперации(Режим)
	
	ВидыОпераций.ЗаполнитьЗначения(Режим, "Пометка");	
	
КонецПроцедуры	

///////////////////////////////////////////////

Процедура ФайлыОбменПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ОписаниеОшибок) тогда
		ОформлениеСтроки.ЦветФона = WebЦвета.СветлоРозовый;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ФайлыОбменВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = ЭлементыФормы.ФайлыОбмен.ТекущаяСтрока;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ОписаниеОшибок) тогда
		ВывестиОтчетПоОшибкам(СтрокаТабличнойЧасти);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыбратьКаталогХраненияФайлов()
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДиалогВыбора.Выбрать() тогда
		КаталогФайлов = ДиалогВыбора.Каталог + "\";
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЗаполнитьНачальныеНастройки();
	ЗаполнитьТаблицуОпераций()
	
КонецПроцедуры

Процедура УстановитьПометкуНажатие(Элемент)
	УстановитьРежимПометкиОперации(Истина);
КонецПроцедуры

Процедура СнятьПометкуНажатие(Элемент)
	УстановитьРежимПометкиОперации(Ложь);
КонецПроцедуры

Процедура ДействияФормыПроверитьСоединение(Кнопка)
	УстановитьСоединение();
КонецПроцедуры

Процедура ОсновныеДействияФормыОбмен(Кнопка)
	ВыполнитьОбмен(ВидыОпераций);
КонецПроцедуры
