
Процедура кнСоздатьЗаявкиНажатие(Элемент)
	
	СоздатьЗаявкиДляТранзита();
	
КонецПроцедуры

Процедура кнВыгрузитьДанныеНажатие(Элемент)
	
	ВыгрузитьДанные();
	
КонецПроцедуры

Процедура кнЗагрузитьДанныеНажатие(Элемент)
	
	ЗагрузитьДанные();
	
КонецПроцедуры

Процедура ОбработатьЗаявкиДля1СНажатие(Элемент)
	ОбработатьЗаявкиДля1С();
КонецПроцедуры

Процедура КоманднаяПанель1ПосмотретьЖурналЗаявок(Кнопка)
	
	ФормаЖурналаСостоянийЗаявок = ПолучитьФорму("РегистрСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.ФормаСписка",,ЭтаФОрма);
	
	Список_ИсточникПриемник = Новый СписокЗначений;
	Список_ИсточникПриемник.Добавить("1С");
	Список_ИсточникПриемник.Добавить("1C");
	Список_ИсточникПриемник.Добавить("TRANSIT");
	Список_ИсточникПриемник.Добавить("WMS");
	
	НовЭлементОтбора = ФормаЖурналаСостоянийЗаявок.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Источник");
	НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	НовЭЛементОтбора.ПравоеЗначение = Список_ИсточникПриемник;
	НовЭлементОтбора.Использование = Истина;
	
	НовЭлементОтбора = ФормаЖурналаСостоянийЗаявок.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Приемник");
	НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	НовЭЛементОтбора.ПравоеЗначение = Список_ИсточникПриемник;
	НовЭлементОтбора.Использование = Истина;
	
	НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаЗаписи");
	НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	НовЭлементОтбора.ПравоеЗначение = НачалоДня(ТекущаяДата()) ;
	НовЭлементОтбора.Использование = Истина;	
	
	ФормаЖурналаСостоянийЗаявок.Открыть();
	
КонецПроцедуры

Процедура КоманднаяПанель1ЗагрузитьОписи(Кнопка)
	
	ФормаЗагрузкиОписей = ПолучитьФорму("фЗагрузкиИнвОписей");
	ФормаЗагрузкиОписей.ВладелецФормы = ЭтаФорма;
	ФормаЗагрузкиОписей.Открыть();
		
КонецПроцедуры

Процедура КоманднаяПанель1ЗагрузитьКорректировкиЗапасов(Кнопка)
	
	СоздатьДокументыКорректировкиЗапасовПоКнопке();	
	
КонецПроцедуры
