
&НаСервере
Процедура КомандаПолучитьНоменклатуруНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьНоменклатуру();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьНоменклатуру(Команда)
	КомандаПолучитьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПолучитьПартииНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьПартии();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьПартии(Команда)
	КомандаПолучитьПартииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПолучитьДокументыНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьДокументы(Команда)
	КомандаПолучитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПолучитьТранспортировкиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьТранспортировки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьТранспортировки(Команда)
	КомандаПолучитьТранспортировкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПодтвердитьПоставкиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПодтвердитьПоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьПоставки(Команда)
	КомандаПодтвердитьПоставкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОтправитьОстаткиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтправитьОстатки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьОстатки(Команда)
	КомандаОтправитьОстаткиНаСервере();
КонецПроцедуры
